In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [3]:
obj = Series([4, 7, -5, 3])  # auto-generate indexes
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.values, type(obj.values)  # values refer to nparray

(array([ 4,  7, -5,  3]), numpy.ndarray)

In [10]:
obj.index, type(obj.index)  # indexes not refer to nparray

(Int64Index([0, 1, 2, 3], dtype='int64'), pandas.core.index.Int64Index)

In [12]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])  # custom indexes
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [14]:
obj2['b']  # indexing with indexes

7

In [15]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [16]:
obj2[['c', 'a', 'b']]  # array of indexes

c    3
a   -5
b    7
dtype: int64

In [17]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [18]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [19]:
obj2 * 2  # index-preserving

d    12
b    14
a   -10
c     6
dtype: int64

In [21]:
import numpy as np
np.exp(obj2)  # index-preserving

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [22]:
# Series can be thought of as fixed-length ordereddict
'b' in obj2  # key-like

True

In [23]:
'f' in obj2

False

In [24]:
sdata = {
    'ohio': 35000,
    'oregon': 16000, 
    'texas': 71000,
    'utah': 5000
}
obj3 = Series(sdata)  # series from python dict, keys in sorted order
obj3

ohio      35000
oregon    16000
texas     71000
utah       5000
dtype: int64

In [25]:
states = ['california', 'ohio', 'oregon', 'texas']
obj4 = Series(sdata, index=states)  # auto index aligning
obj4

california      NaN
ohio          35000
oregon        16000
texas         71000
dtype: float64

In [26]:
pd.isnull(obj4)

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [27]:
pd.notnull(obj4)

california    False
ohio           True
oregon         True
texas          True
dtype: bool

In [28]:
obj4.isnull()  # available as methods, too

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [29]:
obj3 + obj4  # automatic alignment of indexes in arithmatic operations

california       NaN
ohio           70000
oregon         32000
texas         142000
utah             NaN
dtype: float64

In [31]:
obj4.name = 'population'  # custom series name
obj4.index.name = 'state'  # custom index name
obj4

state
california      NaN
ohio          35000
oregon        16000
texas         71000
Name: population, dtype: float64

In [32]:
obj.index = ['bob', 'jeff', 'steve', 'ryan']  # assign new indexes
obj

bob      4
jeff     7
steve   -5
ryan     3
dtype: int64

### dataframe

In [3]:
from pandas import Series, DataFrame
import pandas as pd
data = {
    'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
}  # of equal length

In [4]:
frame = DataFrame(data)  # column sorted automatically
frame

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002

In [5]:
DataFrame(data, columns=['year', 'state', 'pop'])  # custom order when selecting columns

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9

In [6]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'])  # select a column not contained in data
frame2

   year   state  pop debt
0  2000    ohio  1.5  NaN
1  2001    ohio  1.7  NaN
2  2002    ohio  3.6  NaN
3  2001  nevada  2.4  NaN
4  2002  nevada  2.9  NaN

In [7]:
frame2['state'], frame2.year

(0      ohio
 1      ohio
 2      ohio
 3    nevada
 4    nevada
 Name: state, dtype: object, 0    2000
 1    2001
 2    2002
 3    2001
 4    2002
 Name: year, dtype: int64)

In [8]:
# change indexes
frame2.index = ['one', 'two', 'three', 'four', 'five']
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN

In [10]:
# selecting rows, also a Series type
frame2.ix['three'], type(frame2.ix['three'])

(year     2002
 state    ohio
 pop       3.6
 debt      NaN
 Name: three, dtype: object, pandas.core.series.Series)

In [11]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5

In [12]:
import numpy as np
frame2['debt'] = np.arange(5.)  # assign with nparray
frame2

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2001    ohio  1.7     1
three  2002    ohio  3.6     2
four   2001  nevada  2.4     3
five   2002  nevada  2.9     4

In [13]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])  # align with indexes
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -1.7

In [14]:
frame2['eastern'] = (frame2.state == 'ohio')
frame2

       year   state  pop  debt eastern
one    2000    ohio  1.5   NaN    True
two    2001    ohio  1.7  -1.2    True
three  2002    ohio  3.6   NaN    True
four   2001  nevada  2.4  -1.5   False
five   2002  nevada  2.9  -1.7   False

In [15]:
del frame2['eastern']
frame2.columns  # a view, NOT A COPY

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [17]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}  # use inner keys to add indexes, ourter keys are always column names
frame3 = DataFrame(pop)
frame3

      Nevada  ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [18]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
ohio     1.5   1.7   3.6

In [19]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [21]:
pdata = {'ohio': frame3['ohio'][:-1], 'nevada': frame3['Nevada'][:2]}  # create with dict of Series (dict of dicts)
DataFrame(pdata)

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7

In [22]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [23]:
frame3.values  # nparray in 2D

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [24]:
frame2.values  # a dtype that can acommodate all the dtypes will be chosen

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'nevada', 2.4, -1.5],
       [2002, 'nevada', 2.9, -1.7]], dtype=object)

### index objects

In [26]:
obj = Series(np.arange(3), index=['a', 'b', 'c'])
index = obj.index
index, type(index)  # NOT a series objext

(Index(['a', 'b', 'c'], dtype='object'), pandas.core.index.Index)

In [27]:
index[:2]

Index(['a', 'b'], dtype='object')

In [28]:
index[1] = 'd'  # cannot be modified, IMMUTABLE

TypeError: Index does not support mutable operations

In [29]:
index = pd.Index(np.arange(3))  # contructor
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index  # singularity, immutability, safely pass index around

True

In [30]:
frame3

state  Nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [31]:
'ohio' in frame3, 'ohio' in frame3.columns, 2003 in frame3.index

(True, True, False)

In [32]:
frame3.index.isin([1999, 2000, 2001])  # set-like operations

array([ True,  True, False], dtype=bool)

### Essential functionality

### reindexing

In [33]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [34]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [35]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [36]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(np.arange(5), method='ffill')  # interpolation for filling values, use the value from the forward one

0      blue
1      blue
2    purple
3    purple
4    yellow
dtype: object

In [37]:
obj3.reindex(np.arange(5), method='bfill')  # use the value from the back one

0      blue
1    purple
2    purple
3    yellow
4    yellow
dtype: object

In [38]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['ohio', 'texas', 'california'])
frame

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [39]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])  # default to rows' index
frame2

   ohio  texas  california
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [40]:
states = ['texas', 'utah', 'california']
frame.reindex(columns=states)  # reindex with columns

   texas  utah  california
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [41]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states)  # method only apply to rows

   texas  utah  california
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [42]:
# alternative for reindexing
frame.ix[['a', 'b', 'c', 'd'], states]  # row, column

   texas  utah  california
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

### dropping entries from an axis

In [43]:
obj = Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')  # drop by index
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [44]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: int64

In [45]:
data = DataFrame(
    np.arange(16).reshape((4, 4)),
    index=['ohio', 'colorado', 'utah', 'new york'],
    columns=['one', 'two', 'three', 'four']
)
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [46]:
data.drop(['colorado', 'ohio'])  # default drop by index

          one  two  three  four
utah        8    9     10    11
new york   12   13     14    15

In [47]:
data.drop('two', axis=1)  # now drop by column

          one  three  four
ohio        0      2     3
colorado    4      6     7
utah        8     10    11
new york   12     14    15

In [48]:
data.drop(['two', 'four'], axis=1)

          one  three
ohio        0      2
colorado    4      6
utah        8     10
new york   12     14

### indexing, selection and filtering

In [49]:
obj = Series(np.arange(4), index=['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [50]:
obj['b']  # select by index, default to select from rows for SERIES

1

In [51]:
obj[1]  # select by row number

1

In [52]:
obj[2:4]

c    2
d    3
dtype: int64

In [53]:
obj[['b', 'c', 'a']]

b    1
c    2
a    0
dtype: int64

In [54]:
obj[[1, 3]]

b    1
d    3
dtype: int64

In [55]:
obj[obj < 2]

a    0
b    1
dtype: int64

In [56]:
obj['b': 'c']  # slicing with labels, INCLUSIVE

b    1
c    2
dtype: int64

In [57]:
obj['b', 'c'] = 5

In [58]:
obj

a    0
b    5
c    5
d    3
dtype: int64

In [59]:
data = DataFrame(
    np.arange(16).reshape(4, 4),
    index=['ohio', 'colorado', 'utah', 'new york'],
    columns=['one', 'two', 'three', 'four']
)
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [60]:
data['two']  # now select by column index

ohio         1
colorado     5
utah         9
new york    13
Name: two, dtype: int64

In [61]:
data[['three', 'one']]  # default for DataFrame is select index in COLUMNS

          three  one
ohio          2    0
colorado      6    4
utah         10    8
new york     14   12

In [62]:
# special case 1: select by slicing, in ROWS
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [63]:
# special case 2: select by boolean array, making DataFrame more numpy array-like
data[data['three'] > 5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [64]:
data < 5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
new york  False  False  False  False

In [65]:
data[data < 5] = 0
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [66]:
### for DataFrame label indexing in ROWS? use ix()
data.ix['colorado', ['two', 'three']]  # row, column

two      5
three    6
Name: colorado, dtype: int64

In [68]:
data.ix[['colorado', 'utah'], [3, 0, 1]]  # always row, column

          four  one  two
colorado     7    0    5
utah        11    8    9

In [69]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: utah, dtype: int64

In [71]:
data.ix[:'utah', 'two']  # slicing with index

ohio        0
colorado    5
utah        9
Name: two, dtype: int64

In [72]:
data.ix[data.three > 5, :3]

          one  two  three
colorado    0    5      6
utah        8    9     10
new york   12   13     14

### arithmetic and data alignment

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1, s2

(a    7.3
 c   -2.5
 d    3.4
 e    1.5
 dtype: float64, a   -2.1
 c    3.6
 e   -1.5
 f    4.0
 g    3.1
 dtype: float64)

In [3]:
s1 + s2  # case for Series

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [4]:
df1 = DataFrame(
    np.arange(9).reshape((3, 3)),
    columns=list('bcd'),
    index=['ohio', 'texas', 'colorado']
)
df2 = DataFrame(
    np.arange(12).reshape((4, 3)),
    columns=list('bde'),
    index=['utah', 'ohio', 'texas', 'oregon']
)
df1, df2

(          b  c  d
 ohio      0  1  2
 texas     3  4  5
 colorado  6  7  8,         b   d   e
 utah    0   1   2
 ohio    3   4   5
 texas   6   7   8
 oregon  9  10  11)

In [5]:
df1 + df2

           b   c   d   e
colorado NaN NaN NaN NaN
ohio       3 NaN   6 NaN
oregon   NaN NaN NaN NaN
texas      9 NaN  12 NaN
utah     NaN NaN NaN NaN

### arithmetic methods with fill values

In [6]:
df1 = DataFrame(np.arange(12).reshape(3, 4), columns=list('abcd'))
df2 = DataFrame(np.arange(20).reshape(4, 5), columns=list('abcde'))

In [7]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [8]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [9]:
df1 + df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [10]:
df1.add(df2, fill_value=0)  # use method to add fill_value

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [11]:
df1.reindex(columns=df2.columns, fill_value=0)  # reindex with fill_value

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

### operation between DataFrame and Series

In [12]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [14]:
arr[0]

array([0, 1, 2, 3])

In [15]:
arr - arr[0]  # broadcasting

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [16]:
frame = DataFrame(
    np.arange(12).reshape((4, 3)),
    columns=list('bde'),
    index=['utah', 'ohio', 'texas', 'oregon']
)
series = frame.ix[0]
frame, series

(        b   d   e
 utah    0   1   2
 ohio    3   4   5
 texas   6   7   8
 oregon  9  10  11, b    0
 d    1
 e    2
 Name: utah, dtype: int64)

In [17]:
frame - series  # default match index in the columns

        b  d  e
utah    0  0  0
ohio    3  3  3
texas   6  6  6
oregon  9  9  9

In [18]:
series2 = Series(range(3), index=list('bef'))  # index will be reindexed to form the union
frame + series2

        b   d   e   f
utah    0 NaN   3 NaN
ohio    3 NaN   6 NaN
texas   6 NaN   9 NaN
oregon  9 NaN  12 NaN

In [19]:
series3 = frame['d']
frame, series3

(        b   d   e
 utah    0   1   2
 ohio    3   4   5
 texas   6   7   8
 oregon  9  10  11, utah       1
 ohio       4
 texas      7
 oregon    10
 Name: d, dtype: int64)

In [20]:
frame.sub(series3, axis=0)  # use method to change default matching to indexes, and use broadcasting

        b  d  e
utah   -1  0  1
ohio   -1  0  1
texas  -1  0  1
oregon -1  0  1

### function application and mapping

In [21]:
frame = DataFrame(
    np.random.randn(4, 3),
    columns=list('bde'),
    index=['utah', 'ohio', 'texas', 'origon']
)
frame

               b         d         e
utah   -0.973529 -1.325638  1.220767
ohio   -0.701142 -0.054597  1.039718
texas   2.300429  0.887538 -0.432288
origon  1.151031 -1.271173 -1.947031

In [22]:
np.abs(frame)  # numpy ufunc

               b         d         e
utah    0.973529  1.325638  1.220767
ohio    0.701142  0.054597  1.039718
texas   2.300429  0.887538  0.432288
origon  1.151031  1.271173  1.947031

In [23]:
f = lambda x: x.max() - x.min()

In [24]:
frame.apply(f)  # default to columns, axis = 0

b    3.273959
d    2.213175
e    3.167798
dtype: float64

In [25]:
frame.apply(f, axis=1)  # apply to rows

utah      2.546405
ohio      1.740860
texas     2.732717
origon    3.098061
dtype: float64

In [26]:
frame.sum()  # just like numpy array methods in data frames

b    1.776788
d   -1.763870
e   -0.118833
dtype: float64

In [29]:
def f(x):
    # instead of returning scalars, we can also return a Series
    return Series([x.min(), x.max()], index=['min', 'max'])

In [30]:
frame.apply(f)

            b         d         e
min -0.973529 -1.325638 -1.947031
max  2.300429  0.887538  1.220767

In [31]:
def g(x):
    return '{0:.2f}'.format(x)

frame.applymap(g)  # element-wise, frame.apply is column/row-wise

            b      d      e
utah    -0.97  -1.33   1.22
ohio    -0.70  -0.05   1.04
texas    2.30   0.89  -0.43
origon   1.15  -1.27  -1.95

In [33]:
frame['e'].apply(g)  # Series' apply is already column/row-wise

utah       1.22
ohio       1.04
texas     -0.43
origon    -1.95
Name: e, dtype: object

### sorting and ranking

In [34]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [35]:
obj.sort_index()  # literally, sort by INDEX, this makes a copy

a    1
b    2
c    3
d    0
dtype: int64

In [36]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [41]:
frame = DataFrame(
    np.arange(8).reshape((2, 4)),
    index=['three', 'one'],
    columns=list('dabc')
)
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [42]:
frame.sort_index()  # axis default to 0, default to ascending

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [44]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [45]:
frame.sort_index(axis=1, ascending=False)  # descending

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [46]:
obj = Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [47]:
obj.order()  # sort a Series by values, DEPRECIATING

/Users/yth/anaconda/envs/101/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

2   -3
3    2
0    4
1    7
dtype: int64

In [48]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [53]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values(), obj.sort_index()  # NAN is sorted to the end of the series

(4    -3
 5     2
 0     4
 2     7
 1   NaN
 3   NaN
 dtype: float64, 0     4
 1   NaN
 2     7
 3   NaN
 4    -3
 5     2
 dtype: float64)

In [50]:
frame = DataFrame({
    'b': [4, 7, -3, 2],
    'c': [0, 1, 0, 1]
})
frame

   b  c
0  4  0
1  7  1
2 -3  0
3  2  1

In [51]:
frame.sort_index(by='b')  # DataFrame sort by values, DEPRECIATING

/Users/yth/anaconda/envs/101/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   b  c
2 -3  0
3  2  1
0  4  0
1  7  1

In [52]:
frame.sort_values(by='b')

   b  c
2 -3  0
3  2  1
0  4  0
1  7  1

In [54]:
"""
For sorting on values: sort_values()
    Series: series.sort_values()
    DataFrame: dataframe.sort_values(by='b)
For sorting on indexes: sort_index()
    Series: series.sort_index()
    DataFrame.sort_index(axis=1)
"""

"\nFor sorting on values: sort_values()\n    Series: series.sort_values()\n    DataFrame: dataframe.sort_values(by='b)\nFor sorting on indexes: sort_index()\n    Series: series.sort_index()\n    DataFrame.sort_index(axis=1)\n"

In [56]:
frame, frame.sort_values(by=['c', 'b'])  # primary c, secondary b

(   b  c
 0  4  0
 1  7  1
 2 -3  0
 3  2  1,    b  c
 2 -3  0
 0  4  0
 3  2  1
 1  7  1)

In [57]:
# ranking is like numpy's argsort()
# except that ties has special management
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [58]:
obj.rank()  # ties default to mean

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [60]:
obj.rank(method='first')  # different tie handling

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [62]:
obj.rank(method='max', ascending=False)  # descending

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [63]:
# ranks for data frames
frame = DataFrame({
        'b': [4.3, 7, -3, 2],
        'a': [0, 1, 0, 1],
        'c': [-2, 5, 8, -2.5]
    })
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [64]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

### axis indexes with duplicate values

In [65]:
# indexes are not mandatory to be unique
obj = Series(np.arange(5), index=list('aabbc'))
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [66]:
obj['a']  # duplicate indexing becomes a Series

a    0
a    1
dtype: int64

In [67]:
obj['c']  # normal indexing returns a scalar

4

In [68]:
obj.index.is_unique

False

In [70]:
df = DataFrame(np.random.randn(4, 3), index=list('aabb'))
df

          0         1         2
a  0.101136 -0.964027 -1.456854
a -0.045870  0.638905  0.087718
b -1.602502  0.182494 -0.337372
b  1.170355  0.115085 -0.576805

In [71]:
df.ix['a']

          0         1         2
a  0.101136 -0.964027 -1.456854
a -0.045870  0.638905  0.087718

### summarzing and computing descriptive statistics

In [72]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [73]:
df = DataFrame(
    [[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
    index=list('abcd'),
    columns=['one', 'two']
)
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [74]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [75]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [76]:
df.mean()  # skipna default to True

one    3.083333
two   -2.900000
dtype: float64

In [77]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [79]:
df.idxmax()

one    b
two    d
dtype: object

In [84]:
df['one'].argmin()  # a Series method

'd'

In [85]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [86]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [87]:
obj = Series(list('aabc') * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [89]:
obj.describe()  # different result for non-numeric data

count     16
unique     3
top        a
freq       8
dtype: object

### correlation and covariance

In [90]:
import pandas.io.data as web

/Users/yth/anaconda/envs/101/lib/python3.5/site-packages/pandas/io/data.py:33: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [91]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)
all_data

{'AAPL':                   Open        High         Low       Close     Volume  \
 Date
 2010-01-04  213.429998  214.499996  212.380001  214.009998  123432400
 2010-01-05  214.599998  215.589994  213.249994  214.379993  150476200
 2010-01-06  214.379993  215.230000  210.750004  210.969995  138040000
 2010-01-07  211.750000  212.000006  209.050005  210.580000  119282800
 2010-01-08  210.299994  212.000006  209.060005  211.980005  111902700
 2010-01-11  212.799997  213.000002  208.450005  210.110003  115557400
 2010-01-12  209.189995  209.769995  206.419998  207.720001  148614900
 2010-01-13  207.870005  210.929995  204.099998  210.650002  151473000
 2010-01-14  210.110003  210.459997  209.020004  209.430000  108223500
 2010-01-15  210.929995  211.599997  205.869999  205.930000  148516900
 2010-01-19  208.330002  215.189999  207.240004  215.039995  182501900
 2010-01-20  214.910006  215.549994  209.500002  211.730000  153038200
 2010-01-21  212.079994  213.309996  207.210003  208.069996  152038600
 2010-01-22  206.780006  207.499996  197.160000  197.750000  220441900
 2010-01-25  202.510002  204.699999  200.190002  203.070002  266424900
 2010-01-26  205.950001  213.710005  202.580004  205.940001  466777500
 2010-01-27  206.849995  210.580000  199.530001  207.880005  430642100
 2010-01-28  204.930004  205.500004  198.699995  199.289995  293375600
 2010-01-29  201.079996  202.199995  190.250002  192.060003  311488100
 2010-02-01  192.369997  196.000000  191.299999  194.729998  187469100
 2010-02-02  195.909998  196.319994  193.379993  195.859997  174585600
 2010-02-03  195.169994  200.200003  194.420004  199.229994  153832000
 2010-02-04  196.730003  198.370001  191.570005  192.050003  189413000
 2010-02-05  192.630003  196.000000  190.850002  195.460001  212576700
 2010-02-08  195.690006  197.880003  193.999994  194.119997  119567700
 2010-02-09  196.419996  197.499994  194.749998  196.190004  158221700
 2010-02-10  195.889997  196.600000  194.260000  195.120007   92590400
 2010-02-11  194.880001  199.750006  194.059996  198.669994  137586400
 2010-02-12  198.109995  201.639996  195.500002  200.379993  163867200
 2010-02-16  201.940002  203.690002  201.520006  203.399996  135934400
 ...                ...         ...         ...         ...        ...
 2016-01-25  101.519997  101.529999   99.209999   99.440002   51794500
 2016-01-26   99.930000  100.879997   98.070000   99.989998   75077000
 2016-01-27   96.040001   96.629997   93.339996   93.419998  133369700
 2016-01-28   93.790001   94.519997   92.389999   94.089996   55678800
 2016-01-29   94.790001   97.339996   94.349998   97.339996   64416500
 2016-02-01   96.470001   96.709999   95.400002   96.430000   40943500
 2016-02-02   95.419998   96.040001   94.279999   94.480003   37357200
 2016-02-03   95.000000   96.839996   94.080002   96.349998   45964300
 2016-02-04   95.860001   97.330002   95.190002   96.599998   46471700
 2016-02-05   96.519997   96.919998   93.690002   94.019997   46418100
 2016-02-08   93.129997   95.699997   93.040001   95.010002   54021400
 2016-02-09   94.290001   95.940002   93.930000   94.989998   44331200
 2016-02-10   95.919998   96.349998   94.099998   94.269997   42245000
 2016-02-11   93.790001   94.720001   92.589996   93.699997   49686200
 2016-02-12   94.190002   94.500000   93.010002   93.989998   40121700
 2016-02-16   95.019997   96.849998   94.610001   96.639999   47490700
 2016-02-17   96.669998   98.209999   96.150002   98.120003   44390200
 2016-02-18   98.839996   98.889999   96.089996   96.260002   38494400
 2016-02-19   96.000000   96.760002   95.800003   96.040001   34485600
 2016-02-22   96.309998   96.900002   95.919998   96.879997   34048200
 2016-02-23   96.400002   96.500000   94.550003   94.690002   31686700
 2016-02-24   93.980003   96.379997   93.320000   96.099998   36155600
 2016-02-25   96.050003   96.760002   95.250000   96.760002   27393900
 2016-02-26   97.199997   98.019997   96.580002   96.910004   28913200
 2016-02-29   96.860001   98.230003   96.650002   96.690002   34876600
 2016-03-01   97.650002  100.769997   97.419998  100.529999   50153900
 2016-03-02  100.510002  100.889999   99.639999  100.750000   33084900
 2016-03-03  100.580002  101.709999  100.449997  101.500000   36792200
 2016-03-04  102.370003  103.750000  101.370003  103.010002   45936500
 2016-03-07  102.389999  102.830002  100.959999  101.870003   35828900

              Adj Close
 Date
 2010-01-04   28.313195
 2010-01-05   28.362145
 2010-01-06   27.911008
 2010-01-07   27.859412
 2010-01-08   28.044630
 2010-01-11   27.797232
 2010-01-12   27.481038
 2010-01-13   27.868673
 2010-01-14   27.707269
 2010-01-15   27.244224
 2010-01-19   28.449462
 2010-01-20   28.011555
 2010-01-21   27.527342
 2010-01-22   26.162022
 2010-01-25   26.865850
 2010-01-26   27.245547
 2010-01-27   27.502206
 2010-01-28   26.365761
 2010-01-29   25.409244
 2010-02-01   25.762481
 2010-02-02   25.911978
 2010-02-03   26.357823
 2010-02-04   25.407921
 2010-02-05   25.859059
 2010-02-08   25.681779
 2010-02-09   25.955637
 2010-02-10   25.814078
 2010-02-11   26.283736
 2010-02-12   26.509966
 2010-02-16   26.909508
 ...                ...
 2016-01-25   98.903329
 2016-01-26   99.450356
 2016-01-27   92.915814
 2016-01-28   93.582196
 2016-01-29   96.814656
 2016-02-01   95.909571
 2016-02-02   93.970098
 2016-02-03   95.830001
 2016-02-04   96.599998
 2016-02-05   94.019997
 2016-02-08   95.010002
 2016-02-09   94.989998
 2016-02-10   94.269997
 2016-02-11   93.699997
 2016-02-12   93.989998
 2016-02-16   96.639999
 2016-02-17   98.120003
 2016-02-18   96.260002
 2016-02-19   96.040001
 2016-02-22   96.879997
 2016-02-23   94.690002
 2016-02-24   96.099998
 2016-02-25   96.760002
 2016-02-26   96.910004
 2016-02-29   96.690002
 2016-03-01  100.529999
 2016-03-02  100.750000
 2016-03-03  101.500000
 2016-03-04  103.010002
 2016-03-07  101.870003

 [1554 rows x 6 columns],
 'GOOG':                   Open        High         Low       Close    Volume  \
 Date
 2010-01-04  626.951088  629.511067  624.241073  626.751061   3927000
 2010-01-05  627.181073  627.841071  621.541045  623.991055   6031900
 2010-01-06  625.861078  625.861078  606.361042  608.261023   7987100
 2010-01-07  609.401025  610.001045  592.651008  594.101005  12876600
 2010-01-08  592.000997  603.251034  589.110988  602.021036   9483900
 2010-01-11  604.461060  604.461060  594.041028  601.111020  14479800
 2010-01-12  597.651011  598.161034  588.001007  590.481036   9742900
 2010-01-13  576.490965  588.381027  573.900966  587.090991  13041800
 2010-01-14  583.900972  594.200988  582.811024  589.850997   8511900
 2010-01-15  593.341025  593.561024  578.041006  580.000965  10909600
 2010-01-19  581.201005  590.420997  576.290999  587.620986   8665700
 2010-01-20  585.981009  585.981009  575.290986  580.411005   6525700
 2010-01-21  583.441002  586.821000  572.251003  582.980970  12662600
 2010-01-22  564.500980  570.600979  534.860888  550.010933  13651700
 2010-01-25  546.590929  549.880931  535.510900  540.000941   8872800
 2010-01-26  537.970896  549.600954  536.290913  542.420931   8743600
 2010-01-27  541.270944  547.650920  535.310934  542.100949   7958400
 2010-01-28  544.490921  547.000908  530.600893  534.290888   6482300
 2010-01-29  538.490905  540.990906  525.610876  529.940896   8311900
 2010-02-01  534.600945  535.810910  530.300883  533.020884   4518400
 2010-02-02  534.960932  534.960932  527.610902  531.120903   8223000
 2010-02-03  528.670892  542.100949  528.230894  540.820899   6020500
 2010-02-04  537.000902  538.000915  525.560885  526.780897   6780600
 2010-02-05  528.400902  533.500888  522.460925  531.290910   6335600
 2010-02-08  532.500936  542.000905  531.530881  533.470930   5408700
 2010-02-09  539.540909  541.530949  535.070901  536.440949   5660200
 2010-02-10  534.070888  537.790902  527.690913  534.450909   5369000
 2010-02-11  533.320894  540.490931  529.500898  536.400943   4838000
 2010-02-12  532.970893  537.150938  530.500910  533.120928   4576400
 2010-02-16  536.870900  544.130933  534.300935  541.300902   7336100
 ...                ...         ...         ...         ...       ...
 2016-01-25  723.580017  729.679993  710.010010  711.669983   1711700
 2016-01-26  713.849976  718.280029  706.479980  713.039978   1331700
 2016-01-27  713.669983  718.234985  694.390015  699.989990   2194200
 2016-01-28  722.219971  733.690002  712.349976  730.960022   2676400
 2016-01-29  731.530029  744.989990  726.799988  742.950012   3474300
 2016-02-01  750.460022  757.859985  743.270020  752.000000   5139200
 2016-02-02  784.500000  789.869995  764.650024  764.650024   6348100
 2016-02-03  770.219971  774.500000  720.500000  726.950012   6171000
 2016-02-04  722.809998  727.000000  701.859985  708.010010   5168700
 2016-02-05  703.869995  703.989990  680.150024  683.570007   5105700
 2016-02-08  667.849976  684.030029  663.059998  682.739990   4247400
 2016-02-09  672.320007  699.900024  668.770020  678.109985   3608900
 2016-02-10  686.859985  701.309998  682.130005  684.119995   2638000
 2016-02-11  675.000000  689.349976  668.867981  683.109985   3024000
 2016-02-12  690.260010  693.750000  678.599976  682.400024   2141400
 2016-02-16  692.979980  698.000000  685.049988  691.000000   2520000
 2016-02-17  698.090027  709.750000  691.380005  708.400024   2490000
 2016-02-18  710.000000  712.349976  696.030029  697.349976   1859100
 2016-02-19  695.030029  703.080994  694.049988  700.909973   1582300
 2016-02-22  707.450012  713.239990  702.510010  706.460022   1946100
 2016-02-23  701.450012  708.400024  693.580017  695.849976   1999700
 2016-02-24  688.919983  700.000000  680.780029  699.559998   1958600
 2016-02-25  700.010010  705.979980  690.585022  705.750000   1631900
 2016-02-26  708.580017  713.429993  700.859985  705.070007   2240000
 2016-02-29  700.320007  710.890015  697.679993  697.770020   2280300
 2016-03-01  703.619995  718.809998  699.770020  718.809998   2147400
 2016-03-02  719.000000  720.000000  712.000000  718.849976   1627800
 2016-03-03  718.679993  719.450012  706.020020  712.419983   1956800
 2016-03-04  714.989990  716.489990  706.020020  710.890015   1967900
 2016-03-07  706.900024  708.091003  686.900024  695.159973   2985100

              Adj Close
 Date
 2010-01-04  313.062468
 2010-01-05  311.683844
 2010-01-06  303.826685
 2010-01-07  296.753749
 2010-01-08  300.709808
 2010-01-11  300.255255
 2010-01-12  294.945572
 2010-01-13  293.252243
 2010-01-14  294.630868
 2010-01-15  289.710772
 2010-01-19  293.516976
 2010-01-20  289.915587
 2010-01-21  291.199286
 2010-01-22  274.730736
 2010-01-25  269.730740
 2010-01-26  270.939526
 2010-01-27  270.779695
 2010-01-28  266.878565
 2010-01-29  264.705742
 2010-02-01  266.244198
 2010-02-02  265.295156
 2010-02-03  270.140309
 2010-02-04  263.127321
 2010-02-05  265.380075
 2010-02-08  266.468996
 2010-02-09  267.952522
 2010-02-10  266.958496
 2010-02-11  267.932539
 2010-02-12  266.294170
 2010-02-16  270.380071
 ...                ...
 2016-01-25  711.669983
 2016-01-26  713.039978
 2016-01-27  699.989990
 2016-01-28  730.960022
 2016-01-29  742.950012
 2016-02-01  752.000000
 2016-02-02  764.650024
 2016-02-03  726.950012
 2016-02-04  708.010010
 2016-02-05  683.570007
 2016-02-08  682.739990
 2016-02-09  678.109985
 2016-02-10  684.119995
 2016-02-11  683.109985
 2016-02-12  682.400024
 2016-02-16  691.000000
 2016-02-17  708.400024
 2016-02-18  697.349976
 2016-02-19  700.909973
 2016-02-22  706.460022
 2016-02-23  695.849976
 2016-02-24  699.559998
 2016-02-25  705.750000
 2016-02-26  705.070007
 2016-02-29  697.770020
 2016-03-01  718.809998
 2016-03-02  718.849976
 2016-03-03  712.419983
 2016-03-04  710.890015
 2016-03-07  695.159973

 [1554 rows x 6 columns],
 'IBM':                   Open        High         Low       Close    Volume  \
 Date
 2010-01-04  131.179993  132.970001  130.850006  132.449997   6155300
 2010-01-05  131.679993  131.850006  130.100006  130.850006   6841400
 2010-01-06  130.679993  131.490005  129.809998  130.000000   5605300
 2010-01-07  129.869995  130.250000  128.910004  129.550003   5840600
 2010-01-08  129.070007  130.919998  129.050003  130.850006   4197200
 2010-01-11  131.059998  131.059998  128.669998  129.479996   5730400
 2010-01-12  129.029999  131.330002  129.000000  130.509995   8081500
 2010-01-13  130.389999  131.119995  129.160004  130.229996   6455400
 2010-01-14  130.550003  132.710007  129.910004  132.309998   7111800
 2010-01-15  132.029999  132.889999  131.089996  131.779999   8494400
 2010-01-19  131.630005  134.250000  131.559998  134.139999  13916200
 2010-01-20  130.460007  131.149994  128.949997  130.250000  15197500
 2010-01-21  130.470001  130.690002  128.059998  129.000000   9608600
 2010-01-22  128.669998  128.889999  125.370003  125.500000  10088600
 2010-01-25  126.330002  126.889999  125.709999  126.120003   5738500
 2010-01-26  125.919998  127.750000  125.410004  125.750000   7135300
 2010-01-27  125.820000  126.959999  125.040001  126.330002   8719200
 2010-01-28  127.029999  127.040001  123.050003  123.750000   9622200
 2010-01-29  124.320000  125.000000  121.900002  122.389999  11571200
 2010-02-01  123.230003  124.949997  122.779999  124.669998   7242900
 2010-02-02  124.790001  125.809998  123.949997  125.529999   5899900
 2010-02-03  125.160004  126.070000  125.070000  125.660004   4177100
 2010-02-04  125.190002  125.440002  122.900002  123.000000   9126900
 2010-02-05  123.040001  123.720001  121.830002  123.519997   8617000
 2010-02-08  123.150002  123.220001  121.739998  121.879997   5718500
 2010-02-09  122.650002  124.199997  122.459999  123.209999   6044500
 2010-02-10  122.940002  123.650002  122.209999  122.809998   5219100
 2010-02-11  122.580002  124.199997  122.059998  123.730003   5089000
 2010-02-12  123.010002  124.050003  121.610001  124.000000   8017700
 2010-02-16  124.910004  125.230003  124.110001  125.230003   6777300
 ...                ...         ...         ...         ...       ...
 2016-01-25  122.099998  124.230003  121.639999  122.080002   5446000
 2016-01-26  122.250000  123.610001  122.239998  122.589996   4617800
 2016-01-27  122.730003  123.370003  120.650002  120.959999   5026400
 2016-01-28  121.260002  122.830002  121.010002  122.220001   3942500
 2016-01-29  123.279999  124.790001  122.959999  124.790001   8248100
 2016-02-01  124.400002  125.290001  123.709999  124.830002   3574900
 2016-02-02  123.669998  124.139999  122.639999  122.940002   3287300
 2016-02-03  123.989998  125.449997  122.290001  124.720001   6223500
 2016-02-04  125.080002  128.500000  125.000000  127.650002   5266500
 2016-02-05  127.220001  128.639999  125.849998  128.570007   7177700
 2016-02-08  126.000000  127.510002  124.129997  126.980003   7364000
 2016-02-09  126.120003  126.930000  123.769997  124.070000   5957200
 2016-02-10  125.000000  125.290001  119.839996  120.190002   6435100
 2016-02-11  118.779999  119.660004  116.900002  117.849998   7196100
 2016-02-12  119.260002  121.050003  118.349998  121.040001   4899000
 2016-02-16  121.830002  123.089996  121.339996  122.739998   4015600
 2016-02-17  123.709999  126.570000  123.250000  126.099998   4805500
 2016-02-18  130.000000  134.000000  129.750000  132.449997   9924900
 2016-02-19  132.360001  133.649994  130.839996  133.080002   5108500
 2016-02-22  133.080002  134.309998  132.410004  133.770004   4440500
 2016-02-23  133.139999  133.410004  132.009995  132.399994   3366800
 2016-02-24  131.550003  133.490005  129.679993  132.800003   4079800
 2016-02-25  133.289993  134.509995  130.880005  134.500000   4353600
 2016-02-26  134.509995  134.919998  131.949997  132.029999   4382900
 2016-02-29  132.000000  133.360001  130.899994  131.029999   4253300
 2016-03-01  132.240005  134.639999  132.029999  134.369995   3781100
 2016-03-02  133.699997  137.440002  133.220001  136.300003   5163000
 2016-03-03  137.220001  137.960007  136.070007  137.800003   5141200
 2016-03-04  137.539993  139.419998  137.020004  137.800003   3945100
 2016-03-07  137.279999  140.509995  136.869995  140.149994   5142400

              Adj Close
 Date
 2010-01-04  115.385996
 2010-01-05  113.992138
 2010-01-06  113.251641
 2010-01-07  112.859619
 2010-01-08  113.992138
 2010-01-11  112.798631
 2010-01-12  113.695931
 2010-01-13  113.452005
 2010-01-14  115.264033
 2010-01-15  114.802316
 2010-01-19  116.858269
 2010-01-20  113.469432
 2010-01-21  112.380474
 2010-01-22  109.331392
 2010-01-25  109.871517
 2010-01-26  109.549183
 2010-01-27  110.054461
 2010-01-28  107.806850
 2010-01-29  106.622063
 2010-02-01  108.608322
 2010-02-02  109.357526
 2010-02-03  109.470782
 2010-02-04  107.153476
 2010-02-05  107.606479
 2010-02-08  106.652662
 2010-02-09  107.816497
 2010-02-10  107.466471
 2010-02-11  108.271533
 2010-02-12  108.507797
 2010-02-16  109.584128
 ...                ...
 2016-01-25  120.845625
 2016-01-26  121.350463
 2016-01-27  119.736947
 2016-01-28  120.984209
 2016-01-29  123.528223
 2016-02-01  123.567819
 2016-02-02  121.696930
 2016-02-03  123.458931
 2016-02-04  126.359305
 2016-02-05  127.270009
 2016-02-08  126.980003
 2016-02-09  124.070000
 2016-02-10  120.190002
 2016-02-11  117.849998
 2016-02-12  121.040001
 2016-02-16  122.739998
 2016-02-17  126.099998
 2016-02-18  132.449997
 2016-02-19  133.080002
 2016-02-22  133.770004
 2016-02-23  132.399994
 2016-02-24  132.800003
 2016-02-25  134.500000
 2016-02-26  132.029999
 2016-02-29  131.029999
 2016-03-01  134.369995
 2016-03-02  136.300003
 2016-03-03  137.800003
 2016-03-04  137.800003
 2016-03-07  140.149994

 [1554 rows x 6 columns],
 'MSFT':                  Open       High        Low      Close     Volume  Adj Close
 Date
 2010-01-04  30.620001  31.100000  30.590000  30.950001   38409100  26.227603
 2010-01-05  30.850000  31.100000  30.639999  30.959999   49749600  26.236076
 2010-01-06  30.879999  31.080000  30.520000  30.770000   58182400  26.075067
 2010-01-07  30.629999  30.700001  30.190001  30.450001   50559700  25.803894
 2010-01-08  30.280001  30.879999  30.240000  30.660000   51197400  25.981851
 2010-01-11  30.709999  30.760000  30.120001  30.270000   68754700  25.651358
 2010-01-12  30.150000  30.400000  29.910000  30.070000   65912100  25.481874
 2010-01-13  30.260000  30.520000  30.010000  30.350000   51863500  25.719151
 2010-01-14  30.309999  31.100000  30.260000  30.959999   63228100  26.236076
 2010-01-15  31.080000  31.240000  30.709999  30.860001   79913200  26.151335
 2010-01-19  30.750000  31.240000  30.680000  31.100000   46575700  26.354715
 2010-01-20  30.809999  30.940001  30.309999  30.590000   54849500  25.922532
 2010-01-21  30.610001  30.719999  30.000000  30.010000   73086700  25.431029
 2010-01-22  30.000000  30.200001  28.840000  28.959999  102004600  24.541239
 2010-01-25  29.240000  29.660000  29.100000  29.320000   63373000  24.846310
 2010-01-26  29.200001  29.850000  29.090000  29.500000   66639900  24.998845
 2010-01-27  29.350000  29.820000  29.020000  29.670000   63949500  25.142907
 2010-01-28  29.840000  29.870001  28.889999  29.160000  117513700  24.710723
 2010-01-29  29.900000  29.920000  27.660000  28.180000  193888500  23.880253
 2010-02-01  28.389999  28.480000  27.920000  28.410000   85931100  24.075159
 2010-02-02  28.370001  28.500000  28.139999  28.459999   54413700  24.117529
 2010-02-03  28.260000  28.790001  28.120001  28.629999   61397900  24.261591
 2010-02-04  28.379999  28.500000  27.809999  27.840000   77850000  23.592131
 2010-02-05  28.000000  28.280001  27.570000  28.020000   80960100  23.744666
 2010-02-08  28.010000  28.080000  27.570000  27.719999   52820600  23.490440
 2010-02-09  27.969999  28.340000  27.750000  28.010000   59195800  23.736192
 2010-02-10  28.030001  28.240000  27.840000  27.990000   48591300  23.719243
 2010-02-11  27.930000  28.400000  27.700001  28.120001   65993700  23.829409

In [93]:
price = DataFrame({
        tic: data['Adj Close']
        for tic, data in all_data.items()
    })
volume = DataFrame({
        tic: data['Volume']
        for tic, data in all_data.items()
    })
price, volume

(                  AAPL        GOOG         IBM       MSFT
 Date
 2010-01-04   28.313195  313.062468  115.385996  26.227603
 2010-01-05   28.362145  311.683844  113.992138  26.236076
 2010-01-06   27.911008  303.826685  113.251641  26.075067
 2010-01-07   27.859412  296.753749  112.859619  25.803894
 2010-01-08   28.044630  300.709808  113.992138  25.981851
 2010-01-11   27.797232  300.255255  112.798631  25.651358
 2010-01-12   27.481038  294.945572  113.695931  25.481874
 2010-01-13   27.868673  293.252243  113.452005  25.719151
 2010-01-14   27.707269  294.630868  115.264033  26.236076
 2010-01-15   27.244224  289.710772  114.802316  26.151335
 2010-01-19   28.449462  293.516976  116.858269  26.354715
 2010-01-20   28.011555  289.915587  113.469432  25.922532
 2010-01-21   27.527342  291.199286  112.380474  25.431029
 2010-01-22   26.162022  274.730736  109.331392  24.541239
 2010-01-25   26.865850  269.730740  109.871517  24.846310
 2010-01-26   27.245547  270.939526  109.549183  24.998845
 2010-01-27   27.502206  270.779695  110.054461  25.142907
 2010-01-28   26.365761  266.878565  107.806850  24.710723
 2010-01-29   25.409244  264.705742  106.622063  23.880253
 2010-02-01   25.762481  266.244198  108.608322  24.075159
 2010-02-02   25.911978  265.295156  109.357526  24.117529
 2010-02-03   26.357823  270.140309  109.470782  24.261591
 2010-02-04   25.407921  263.127321  107.153476  23.592131
 2010-02-05   25.859059  265.380075  107.606479  23.744666
 2010-02-08   25.681779  266.468996  106.652662  23.490440
 2010-02-09   25.955637  267.952522  107.816497  23.736192
 2010-02-10   25.814078  266.958496  107.466471  23.719243
 2010-02-11   26.283736  267.932539  108.271533  23.829409
 2010-02-12   26.509966  266.294170  108.507797  23.668399
 2010-02-16   26.909508  270.380071  109.584128  24.136659
 ...                ...         ...         ...        ...
 2016-01-25   98.903329  711.669983  120.845625  51.420805
 2016-01-26   99.450356  713.039978  121.350463  51.798093
 2016-01-27   92.915814  699.989990  119.736947  50.854868
 2016-01-28   93.582196  730.960022  120.984209  51.688880
 2016-01-29   96.814656  742.950012  123.528223  54.697279
 2016-02-01   95.909571  752.000000  123.567819  54.319987
 2016-02-02   93.970098  764.650024  121.696930  52.622178
 2016-02-03   95.830001  726.950012  123.458931  51.788166
 2016-02-04   96.599998  708.010010  126.359305  51.629307
 2016-02-05   94.019997  683.570007  127.270009  49.802423
 2016-02-08   95.010002  682.739990  126.980003  49.057770
 2016-02-09   94.989998  678.109985  124.070000  48.928696
 2016-02-10   94.269997  684.119995  120.190002  49.355631
 2016-02-11   93.699997  683.109985  117.849998  49.335773
 2016-02-12   93.989998  682.400024  121.040001  50.140000
 2016-02-16   96.639999  691.000000  122.739998  51.090000
 2016-02-17   98.120003  708.400024  126.099998  52.419998
 2016-02-18   96.260002  697.349976  132.449997  52.189999
 2016-02-19   96.040001  700.909973  133.080002  51.820000
 2016-02-22   96.879997  706.460022  133.770004  52.650002
 2016-02-23   94.690002  695.849976  132.399994  51.180000
 2016-02-24   96.099998  699.559998  132.800003  51.360001
 2016-02-25   96.760002  705.750000  134.500000  52.099998
 2016-02-26   96.910004  705.070007  132.029999  51.299999
 2016-02-29   96.690002  697.770020  131.029999  50.880001
 2016-03-01  100.529999  718.809998  134.369995  52.580002
 2016-03-02  100.750000  718.849976  136.300003  52.950001
 2016-03-03  101.500000  712.419983  137.800003  52.349998
 2016-03-04  103.010002  710.890015  137.800003  52.029999
 2016-03-07  101.870003  695.159973  140.149994  51.029999

 [1554 rows x 4 columns],                  AAPL      GOOG       IBM       MSFT
 Date
 2010-01-04  123432400   3927000   6155300   38409100
 2010-01-05  150476200   6031900   6841400   49749600
 2010-01-06  138040000   7987100   5605300   58182400
 2010-01-07  119282800  12876600   5840600   50559700
 2010-01-08  111902700   9483900   4197200   51197400
 2010-01-11  115557400  14479800   5730400   68754700
 2010-01-12  148614900   9742900   8081500   65912100
 2010-01-13  151473000  13041800   6455400   51863500
 2010-01-14  108223500   8511900   7111800   63228100
 2010-01-15  148516900  10909600   8494400   79913200
 2010-01-19  182501900   8665700  13916200   46575700
 2010-01-20  153038200   6525700  15197500   54849500
 2010-01-21  152038600  12662600   9608600   73086700
 2010-01-22  220441900  13651700  10088600  102004600
 2010-01-25  266424900   8872800   5738500   63373000
 2010-01-26  466777500   8743600   7135300   66639900
 2010-01-27  430642100   7958400   8719200   63949500
 2010-01-28  293375600   6482300   9622200  117513700
 2010-01-29  311488100   8311900  11571200  193888500
 2010-02-01  187469100   4518400   7242900   85931100
 2010-02-02  174585600   8223000   5899900   54413700
 2010-02-03  153832000   6020500   4177100   61397900
 2010-02-04  189413000   6780600   9126900   77850000
 2010-02-05  212576700   6335600   8617000   80960100
 2010-02-08  119567700   5408700   5718500   52820600
 2010-02-09  158221700   5660200   6044500   59195800
 2010-02-10   92590400   5369000   5219100   48591300
 2010-02-11  137586400   4838000   5089000   65993700
 2010-02-12  163867200   4576400   8017700   81117200
 2010-02-16  135934400   7336100   6777300   51935600
 ...               ...       ...       ...        ...
 2016-01-25   51794500   1711700   5446000   34707700
 2016-01-26   75077000   1331700   4617800   28900800
 2016-01-27  133369700   2194200   5026400   36775200
 2016-01-28   55678800   2676400   3942500   62513800
 2016-01-29   64416500   3474300   8248100   83611700
 2016-02-01   40943500   5139200   3574900   44208500
 2016-02-02   37357200   6348100   3287300   56313800
 2016-02-03   45964300   6171000   6223500   57559800
 2016-02-04   46471700   5168700   5266500   46987100
 2016-02-05   46418100   5105700   7177700   62009000
 2016-02-08   54021400   4247400   7364000   59290500
 2016-02-09   44331200   3608900   5957200   46740500
 2016-02-10   42245000   2638000   6435100   38237000
 2016-02-11   49686200   3024000   7196100   48878600
 2016-02-12   40121700   2141400   4899000   34243300
 2016-02-16   47490700   2520000   4015600   35937100
 2016-02-17   44390200   2490000   4805500   39670300
 2016-02-18   38494400   1859100   9924900   26244700
 2016-02-19   34485600   1582300   5108500   33275400
 2016-02-22   34048200   1946100   4440500   24854400
 2016-02-23   31686700   1999700   3366800   28390800
 2016-02-24   36155600   1958600   4079800   32076000
 2016-02-25   27393900   1631900   4353600   26695900
 2016-02-26   28913200   2240000   4382900   35869200
 2016-02-29   34876600   2280300   4253300   31247100
 2016-03-01   50153900   2147400   3781100   32778500
 2016-03-02   33084900   1627800   5163000   29049200
 2016-03-03   36792200   1956800   5141200   24418100
 2016-03-04   45936500   1967900   3945100   32280400
 2016-03-07   35828900   2985100   5142400   38407800

 [1554 rows x 4 columns])

In [94]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-03-01  0.039715  0.030153  0.025490  0.033412
2016-03-02  0.002188  0.000056  0.014363  0.007037
2016-03-03  0.007444 -0.008945  0.011005 -0.011332
2016-03-04  0.014877 -0.002148  0.000000 -0.006113
2016-03-07 -0.011067 -0.022127  0.017054 -0.019220

In [95]:
returns['MSFT'].corr(returns['IBM'])  # Series

0.50079116426248049

In [96]:
returns['MSFT'].cov(returns['IBM'])  # Series

9.0400254937132455e-05

In [97]:
returns.corr()  # DataFrame

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.409313  0.394773  0.397084
GOOG  0.409313  1.000000  0.399868  0.454979
IBM   0.394773  0.399868  1.000000  0.500791
MSFT  0.397084  0.454979  0.500791  1.000000

In [98]:
returns.cov()  # DataFrame

          AAPL      GOOG       IBM     MSFT
AAPL  0.000287  0.000113  0.000081  0.00010
GOOG  0.000113  0.000265  0.000079  0.00011
IBM   0.000081  0.000079  0.000148  0.00009
MSFT  0.000100  0.000110  0.000090  0.00022

In [99]:
returns.corrwith(returns.IBM)  # DataFrame corrWith Series

AAPL    0.394773
GOOG    0.399868
IBM     1.000000
MSFT    0.500791
dtype: float64

In [101]:
returns.corrwith(volume)  # DataFrame corrwith DataFrame, matching columes

AAPL   -0.081546
GOOG   -0.001707
IBM    -0.203455
MSFT   -0.081673
dtype: float64

### unique values, value counts and membership

In [102]:
obj = Series(list('cadaabbcc'))

In [103]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [104]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [105]:
obj.value_counts()  # as a Series method

c    3
a    3
b    2
d    1
dtype: int64

In [106]:
pd.value_counts(obj.values)  # as a pandas top-level method

c    3
a    3
b    2
d    1
dtype: int64

In [107]:
mask = obj.isin(list('bc'))
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [108]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [109]:
data = DataFrame({
        'Qu1': [1, 3, 4, 3, 4],
        'Qu2': [2, 3, 1, 2, 3],
        'Qu3': [1, 5, 2, 4, 4]
    })
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [110]:
data.apply(pd.value_counts)  # apply to each column

   Qu1  Qu2  Qu3
1    1    1    1
2  NaN    2    1
3    2    2  NaN
4    2  NaN    2
5  NaN  NaN    1

In [111]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

### handling missing data

In [112]:
from numpy import nan as NA

In [113]:
string_data = Series(['aardvark', 'artichoke', NA, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [114]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [115]:
string_data[0] = NA
string_data

0          NaN
1    artichoke
2          NaN
3      avocado
dtype: object

In [116]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [117]:
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [118]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [119]:
data[data.notnull()]  # boolean filtering also works

0    1.0
2    3.5
4    7.0
dtype: float64

In [121]:
data = DataFrame(
    [[1, 6.5, 3], [1, NA, NA], [NA, NA, NA], [NA, 6.5, 3]]
)
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [122]:
cleaned = data.dropna()  # remove rows that contains ANY NA
cleaned

   0    1  2
0  1  6.5  3

In [123]:
data.dropna(how='all')  # remove rows that ALL contain NA

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [124]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [125]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [127]:
df = DataFrame(np.random.randn(7, 3))

In [128]:
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA
df

          0         1         2
0  0.323986       NaN       NaN
1 -0.415452       NaN       NaN
2  0.349384       NaN       NaN
3 -0.000201       NaN -0.215349
4  0.108098       NaN  1.825984
5  0.697039 -1.318071  1.134732
6  1.083768  0.149328  1.327780

In [129]:
df.dropna(thresh=3)  # need to be at least 3 records

          0         1         2
5  0.697039 -1.318071  1.134732
6  1.083768  0.149328  1.327780

### filling in missing data

In [130]:
df.fillna(0)

          0         1         2
0  0.323986  0.000000  0.000000
1 -0.415452  0.000000  0.000000
2  0.349384  0.000000  0.000000
3 -0.000201  0.000000 -0.215349
4  0.108098  0.000000  1.825984
5  0.697039 -1.318071  1.134732
6  1.083768  0.149328  1.327780

In [131]:
df.fillna({1: 0.5, 3: -1})  # pass in dict, each column fill different values

          0         1         2
0  0.323986  0.500000       NaN
1 -0.415452  0.500000       NaN
2  0.349384  0.500000       NaN
3 -0.000201  0.500000 -0.215349
4  0.108098  0.500000  1.825984
5  0.697039 -1.318071  1.134732
6  1.083768  0.149328  1.327780

In [132]:
df  # fillna and dropna all return a new object

          0         1         2
0  0.323986       NaN       NaN
1 -0.415452       NaN       NaN
2  0.349384       NaN       NaN
3 -0.000201       NaN -0.215349
4  0.108098       NaN  1.825984
5  0.697039 -1.318071  1.134732
6  1.083768  0.149328  1.327780

In [133]:
df.fillna(0, inplace=True)  # inplace change

In [134]:
df

          0         1         2
0  0.323986  0.000000  0.000000
1 -0.415452  0.000000  0.000000
2  0.349384  0.000000  0.000000
3 -0.000201  0.000000 -0.215349
4  0.108098  0.000000  1.825984
5  0.697039 -1.318071  1.134732
6  1.083768  0.149328  1.327780

In [135]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA
df.ix[4:, 2] = NA
df

          0         1         2
0  0.290092 -0.916409  0.365928
1  0.540010 -2.682149 -1.200310
2 -0.695206       NaN -0.341819
3  0.053803       NaN -0.791963
4 -0.147866       NaN       NaN
5 -0.215331       NaN       NaN

In [136]:
df.fillna(method='ffill')  # fill with the forward value

          0         1         2
0  0.290092 -0.916409  0.365928
1  0.540010 -2.682149 -1.200310
2 -0.695206 -2.682149 -0.341819
3  0.053803 -2.682149 -0.791963
4 -0.147866 -2.682149 -0.791963
5 -0.215331 -2.682149 -0.791963

In [137]:
df.fillna(method='ffill', limit=2)  # fill up to two NAs

          0         1         2
0  0.290092 -0.916409  0.365928
1  0.540010 -2.682149 -1.200310
2 -0.695206 -2.682149 -0.341819
3  0.053803 -2.682149 -0.791963
4 -0.147866       NaN -0.791963
5 -0.215331       NaN -0.791963

In [138]:
data = Series([1, NA, 3.5, NA, 7])

In [139]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [140]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### hierarchical indexing

In [141]:
data = Series(
    np.random.randn(10),
    index=[list('aaabbbccdd'), [1, 2, 3, 1, 2, 3, 1, 2, 3, 4]]
)  # multiple levels of index
data

a  1    0.527858
   2   -1.877800
   3   -0.252707
b  1    0.108736
   2    0.315283
   3    0.171873
c  1   -0.135583
   2   -1.024411
d  3   -0.756714
   4    0.426752
dtype: float64

In [142]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3, 4]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 2, 3]])

In [143]:
# partial indexing
data['b']

1    0.108736
2    0.315283
3    0.171873
dtype: float64

In [144]:
data['b': 'c']

b  1    0.108736
   2    0.315283
   3    0.171873
c  1   -0.135583
   2   -1.024411
dtype: float64

In [146]:
data[['b', 'd']]

b  1    0.108736
   2    0.315283
   3    0.171873
d  3   -0.756714
   4    0.426752
dtype: float64

In [147]:
data[:, 2]  # selection into the second level

a   -1.877800
b    0.315283
c   -1.024411
dtype: float64

In [148]:
data

a  1    0.527858
   2   -1.877800
   3   -0.252707
b  1    0.108736
   2    0.315283
   3    0.171873
c  1   -0.135583
   2   -1.024411
d  3   -0.756714
   4    0.426752
dtype: float64

In [149]:
data.unstack()  # unstack into a higher level, DataFrame

          1         2         3         4
a  0.527858 -1.877800 -0.252707       NaN
b  0.108736  0.315283  0.171873       NaN
c -0.135583 -1.024411       NaN       NaN
d       NaN       NaN -0.756714  0.426752

In [150]:
data.unstack().stack()  # unstack and stack are inverse operations

a  1    0.527858
   2   -1.877800
   3   -0.252707
b  1    0.108736
   2    0.315283
   3    0.171873
c  1   -0.135583
   2   -1.024411
d  3   -0.756714
   4    0.426752
dtype: float64

In [151]:
frame = DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[list('aabb'), [1, 2, 1, 2]],
    columns=[['ohio', 'ohio', 'colorado'], ['green', 'red', 'green']]
)  # hierarchical index and column for DataFrame
frame

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [152]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [153]:
frame['ohio']

color      green  red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### rendering and sorting levels

In [154]:
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [155]:
frame.swaplevel('key1', 'key2')

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [157]:
frame.sortlevel(1)  # which is key2

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [158]:
frame.swaplevel(0, 1)  # key1 and key2

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [159]:
frame.swaplevel(0, 1).sortlevel(0)  # which is key2

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [160]:
# data selection performance is much better on hierarchically indexed objects if the index is
# lexicographically sorted starting with the outer most level
# that is, the result of calling sortlevel(0) or sort_index()

### summary statistics by level

In [161]:
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [162]:
frame.sum(level='key2')  # this actually uses groupby() under the hood

state  ohio     colorado
color green red    green
key2
1         6   8       10
2        12  14       16

In [163]:
frame.sum(level='color', axis=1)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [164]:
frame = DataFrame({
        'a': range(7),
        'b': range(7, 0, -1),
        'c': ['one', 'one', 'one', 'two', 'two', 'two', 'twos'],
        'd': [0, 1, 2, 0, 1, 2, 3]
    })
frame

   a  b     c  d
0  0  7   one  0
1  1  6   one  1
2  2  5   one  2
3  3  4   two  0
4  4  3   two  1
5  5  2   two  2
6  6  1  twos  3

In [168]:
frame2 = frame.set_index(['c', 'd'])  # default drop the columns

In [169]:
frame2

        a  b
c    d
one  0  0  7
     1  1  6
     2  2  5
two  0  3  4
     1  4  3
     2  5  2
twos 3  6  1

In [170]:
frame.set_index(['c', 'd'], drop=False)

        a  b     c  d
c    d
one  0  0  7   one  0
     1  1  6   one  1
     2  2  5   one  2
two  0  3  4   two  0
     1  4  3   two  1
     2  5  2   two  2
twos 3  6  1  twos  3

In [167]:
frame2.reset_index()  # undo everything

      c  d  a  b
0   one  0  0  7
1   one  1  1  6
2   one  2  2  5
3   two  0  3  4
4   two  1  4  3
5   two  2  5  2
6  twos  3  6  1

### integer indexing (always label-based)

In [171]:
ser = Series(np.arange(3))
ser

0    0
1    1
2    2
dtype: int64

In [172]:
ser[-1]  # ambiguity between label-based and position-based indexing, default is label-based, therefore the error

KeyError: -1

In [173]:
ser2 = Series(np.arange(3), index=list('abc'))
ser2

a    0
b    1
c    2
dtype: int64

In [174]:
ser2[-1]  # no ambiguity when the indexer is not index basedc

2

In [175]:
ser.ix[:1]  # label based

0    0
1    1
dtype: int64

In [176]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3

-5    0
 1    1
 3    2
dtype: int64

In [177]:
ser3.iget_value(2)  # force position based

/Users/yth/anaconda/envs/101/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  if __name__ == '__main__':

2

In [178]:
ser3.iloc[2]

2

In [179]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])
frame

   0  1
2  0  1
0  2  3
1  4  5

In [180]:
frame.irow(2)

/Users/yth/anaconda/envs/101/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  if __name__ == '__main__':

0    4
1    5
Name: 1, dtype: int64

In [181]:
frame.iloc[2]

0    4
1    5
Name: 1, dtype: int64

In [182]:
# use iloc[] for position-based indexing for both Series and DataFrame

### panel data

In [184]:
pdata = pd.Panel({stk: web.get_data_yahoo(stk) for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']})
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1574 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2016-03-07 00:00:00
Minor_axis axis: Open to Adj Close

In [185]:
pdata = pdata.swapaxes('items', 'minor')

In [186]:
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   28.313195  14.06528  313.062468  26.227603
2010-01-05   28.362145  14.38450  311.683844  26.236076
2010-01-06   27.911008  14.10397  303.826685  26.075067
2010-01-07   27.859412  14.23940  296.753749  25.803894
2010-01-08   28.044630  14.36516  300.709808  25.981851
2010-01-11   27.797232  14.37483  300.255255  25.651358
2010-01-12   27.481038  14.56830  294.945572  25.481874
2010-01-13   27.868673  14.57797  293.252243  25.719151
2010-01-14   27.707269  14.22005  294.630868  26.236076
2010-01-15   27.244224  13.92985  289.710772  26.151335
2010-01-19   28.449462  14.32646  293.516976  26.354715
2010-01-20   28.011555  14.03626  289.915587  25.922532
2010-01-21   27.527342  13.92017  291.199286  25.431029
2010-01-22   26.162022  13.18982  274.730736  24.541239
2010-01-25   26.865850  13.43650  269.730740  24.846310
2010-01-26   27.245547  13.13662  270.939526  24.998845
2010-01-27   27.502206  13.08825  270.779695  25.142907
2010-01-28   26.365761  12.84641  266.878565  24.710723
2010-01-29   25.409244  12.47882  264.705742  23.880253
2010-02-01   25.762481  12.78837  266.244198  24.075159
2010-02-02   25.911978  12.86576  265.295156  24.117529
2010-02-03   26.357823  12.92380  270.140309  24.261591
2010-02-04   25.407921  12.58523  263.127321  23.592131
2010-02-05   25.859059  12.80772  265.380075  23.744666
2010-02-08   25.681779  12.95282  266.468996  23.490440
2010-02-09   25.955637  13.10760  267.952522  23.736192
2010-02-10   25.814078  13.30107  266.958496  23.719243
2010-02-11   26.283736  13.49454  267.932539  23.829409
2010-02-12   26.509966  13.38813  266.294170  23.668399
2010-02-16   26.909508  13.67834  270.380071  24.136659
...                ...       ...         ...        ...
2016-01-25   98.903329       NaN  711.669983  51.420805
2016-01-26   99.450356       NaN  713.039978  51.798093
2016-01-27   92.915814       NaN  699.989990  50.854868
2016-01-28   93.582196       NaN  730.960022  51.688880
2016-01-29   96.814656       NaN  742.950012  54.697279
2016-02-01   95.909571       NaN  752.000000  54.319987
2016-02-02   93.970098       NaN  764.650024  52.622178
2016-02-03   95.830001       NaN  726.950012  51.788166
2016-02-04   96.599998       NaN  708.010010  51.629307
2016-02-05   94.019997       NaN  683.570007  49.802423
2016-02-08   95.010002       NaN  682.739990  49.057770
2016-02-09   94.989998       NaN  678.109985  48.928696
2016-02-10   94.269997       NaN  684.119995  49.355631
2016-02-11   93.699997       NaN  683.109985  49.335773
2016-02-12   93.989998       NaN  682.400024  50.140000
2016-02-16   96.639999       NaN  691.000000  51.090000
2016-02-17   98.120003       NaN  708.400024  52.419998
2016-02-18   96.260002       NaN  697.349976  52.189999
2016-02-19   96.040001       NaN  700.909973  51.820000
2016-02-22   96.879997       NaN  706.460022  52.650002
2016-02-23   94.690002       NaN  695.849976  51.180000
2016-02-24   96.099998       NaN  699.559998  51.360001
2016-02-25   96.760002       NaN  705.750000  52.099998
2016-02-26   96.910004       NaN  705.070007  51.299999
2016-02-29   96.690002       NaN  697.770020  50.880001
2016-03-01  100.529999       NaN  718.809998  52.580002
2016-03-02  100.750000       NaN  718.849976  52.950001
2016-03-03  101.500000       NaN  712.419983  52.349998
2016-03-04  103.010002       NaN  710.890015  52.029999
2016-03-07  101.870003       NaN  695.159973  51.029999

[1574 rows x 4 columns]

In [187]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close     Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900   74.218116
DELL   12.150000   12.300000   12.045000   12.070000   19397600   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300   25.598227

In [188]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   73.686282  14.58765  300.100412  26.776915
2012-05-23   75.484211  12.08221  304.426106  26.192070
2012-05-24   74.790973  12.04351  301.528978  26.156079
2012-05-25   74.390105  12.05319  295.470050  26.147081
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   75.710442  12.24666  296.873645  26.596962
2012-05-30   76.623304  12.14992  293.821674  26.399015
2012-05-31   76.432797  11.92743  290.140354  26.264051
2012-06-01   74.218116  11.67592  285.205295  25.598227
2012-06-04   74.654700  11.60821  289.006480  25.688202
2012-06-05   74.461551  11.76298  284.920579  25.652212
2012-06-06   75.603286  11.81619  289.995487  26.408013
2012-06-07   75.637681  11.73396  288.826666  26.300040
2012-06-08   76.775446  11.72429  289.935570  26.677940
2012-06-11   75.564914  11.47278  283.966519  26.003119
2012-06-12   76.225086  11.57919  282.268201  26.354027
2012-06-13   75.695894  11.87423  280.265216  26.210064
2012-06-14   75.612542  11.93711  279.246220  26.399015
2012-06-15   75.956519  11.89841  281.973510  27.010853
2012-06-18   77.497794  12.01449  285.140358  26.848896
2012-06-19   77.713448  11.78233  290.475012  27.622691
2012-06-20   77.492502  11.89841  288.467038  27.829636
2012-06-21   76.424856  11.60821  282.323161  27.118824
2012-06-22   77.010939  11.80168  285.455033  27.622691
2012-06-25   75.512000  11.55500  280.070407  26.875889
2012-06-26   75.678696  11.53565  282.058429  27.010853
2012-06-27   76.005469  11.92743  284.366112  27.145817
2012-06-28   75.284441  11.55984  281.873596  26.911879
2012-06-29   77.262308  12.10155  289.745749  27.523717
2012-07-02   78.389489  11.98064  289.945546  27.496724
...                ...       ...         ...        ...
2016-01-25   98.903329       NaN  711.669983  51.420805
2016-01-26   99.450356       NaN  713.039978  51.798093
2016-01-27   92.915814       NaN  699.989990  50.854868
2016-01-28   93.582196       NaN  730.960022  51.688880
2016-01-29   96.814656       NaN  742.950012  54.697279
2016-02-01   95.909571       NaN  752.000000  54.319987
2016-02-02   93.970098       NaN  764.650024  52.622178
2016-02-03   95.830001       NaN  726.950012  51.788166
2016-02-04   96.599998       NaN  708.010010  51.629307
2016-02-05   94.019997       NaN  683.570007  49.802423
2016-02-08   95.010002       NaN  682.739990  49.057770
2016-02-09   94.989998       NaN  678.109985  48.928696
2016-02-10   94.269997       NaN  684.119995  49.355631
2016-02-11   93.699997       NaN  683.109985  49.335773
2016-02-12   93.989998       NaN  682.400024  50.140000
2016-02-16   96.639999       NaN  691.000000  51.090000
2016-02-17   98.120003       NaN  708.400024  52.419998
2016-02-18   96.260002       NaN  697.349976  52.189999
2016-02-19   96.040001       NaN  700.909973  51.820000
2016-02-22   96.879997       NaN  706.460022  52.650002
2016-02-23   94.690002       NaN  695.849976  51.180000
2016-02-24   96.099998       NaN  699.559998  51.360001
2016-02-25   96.760002       NaN  705.750000  52.099998
2016-02-26   96.910004       NaN  705.070007  51.299999
2016-02-29   96.690002       NaN  697.770020  50.880001
2016-03-01  100.529999       NaN  718.809998  52.580002
2016-03-02  100.750000       NaN  718.849976  52.950001
2016-03-03  101.500000       NaN  712.419983  52.349998
2016-03-04  103.010002       NaN  710.890015  52.029999
2016-03-07  101.870003       NaN  695.159973  51.029999

[967 rows x 4 columns]

In [190]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900
           DELL    12.110000   12.112500   11.800000   12.000000   17015700
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600
           DELL    11.950000   12.240000   11.950000   12.160000   15620900
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900
           DELL    12.210000   12.280000   12.090000   12.215000   20779900
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700
           DELL    12.320000   12.410000   12.120000   12.130000   20074000
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100
           DELL    12.130000   12.225000   12.020000   12.120000   18155600
...                      ...         ...         ...         ...        ...
2016-02-23 AAPL    96.400002   96.500000   94.550003   94.690002   31686700
           GOOG   701.450012  708.400024  693.580017  695.849976    1999700
           MSFT    52.340000   52.369999   50.980000   51.180000   28390800
2016-02-24 AAPL    93.980003   96.379997   93.320000   96.099998   36155600
           GOOG   688.919983  700.000000  680.780029  699.559998    1958600
           MSFT    50.689999   51.500000   50.200001   51.360001   32076000
2016-02-25 AAPL    96.050003   96.760002   95.250000   96.760002   27393900
           GOOG   700.010010  705.979980  690.585022  705.750000    1631900
           MSFT    51.730000   52.099998   50.610001   52.099998   26695900
2016-02-26 AAPL    97.199997   98.019997   96.580002   96.910004   28913200
           GOOG   708.580017  713.429993  700.859985  705.070007    2240000
           MSFT    52.599998   52.680000   51.099998   51.299999   35869200
2016-02-29 AAPL    96.860001   98.230003   96.650002   96.690002   34876600
           GOOG   700.320007  710.890015  697.679993  697.770020    2280300
           MSFT    51.349998   51.650002   50.660000   50.880001   31247100
2016-03-01 AAPL    97.650002  100.769997   97.419998  100.529999   50153900
           GOOG   703.619995  718.809998  699.770020  718.809998    2147400
           MSFT    50.970001   52.590000   50.919998   52.580002   32778500
2016-03-02 AAPL   100.510002  100.889999   99.639999  100.750000   33084900
           GOOG   719.000000  720.000000  712.000000  718.849976    1627800
           MSFT    52.410000   52.959999   52.160000   52.950001   29049200
2016-03-03 AAPL   100.580002  101.709999  100.449997  101.500000   36792200
           GOOG   718.679993  719.450012  706.020020  712.419983    1956800
           MSFT    52.970001   52.970001   51.779999   52.349998   24418100
2016-03-04 AAPL   102.370003  103.750000  101.370003  103.010002   45936500
           GOOG   714.989990  716.489990  706.020020  710.890015    1967900
           MSFT    52.400002   52.450001   51.709999   52.029999   32280400
2016-03-07 AAPL   102.389999  102.830002  100.959999  101.870003   35828900
           GOOG   706.900024  708.091003  686.900024  695.159973    2985100
           MSFT    51.560001   51.799999   50.580002   51.029999   38407800

                   Adj Close
Date       minor
2012-05-30 AAPL    76.623304
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.399015
2012-05-31 AAPL    76.432797
           DELL    11.927430
           GOOG   290.140354
           MSFT    26.264051
2012-06-01 AAPL    74.218116
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.598227
2012-06-04 AAPL    74.654700
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.688202
2012-06-05 AAPL    74.461551
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.652212
2012-06-06 AAPL    75.603286
           DELL    11.816190
           GOOG   289.995487
           MSFT    26.408013
2012-06-07 AAPL    75.637681
           DELL    11.733960
           GOOG   288.826666
           MSFT    26.300040
2012-06-08 AAPL    76.775446
           DELL    11.724290
...                      ...
2016-02-23 AAPL    94.690002
           GOOG   695.849976
           MSFT    51.180000
2016-02-24 AAPL    96.099998
           GOOG   699.559998
           MSFT    51.360001
2016-02-25 AAPL    96.760002
           GOOG   705.750000
           MSFT    52.099998
2016-02-26 AAPL    96.910004
           GOOG   705.070007
           MSFT    51.299999
2016-02-29 AAPL    96.690002
           GOOG   697.770020
           MSFT    50.880001
2016-03-01 AAPL   100.529999
           GOOG   718.809998
           MSFT    52.580002
2016-03-02 AAPL   100.750000
           GOOG   718.849976
           MSFT    52.950001
2016-03-03 AAPL   101.500000
           GOOG   712.419983
           MSFT    52.349998
2016-03-04 AAPL   103.010002
           GOOG   710.890015
           MSFT    52.029999
2016-03-07 AAPL   101.870003
           GOOG   695.159973
           MSFT    51.029999

[3214 rows x 6 columns]

In [191]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 961 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2016-03-07 00:00:00
Minor_axis axis: AAPL to MSFT

In [ ]:
#       to_frame()      stack()
# Panel <---> DataFrame <---> Series
#       to_panel()      unstack()